{
	"amber": {
		"1": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Who are you?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Tell me about the village."
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Tell me about the Mother Worm."
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"messages": [ "The Mother Worm lives in us all.", "It's a great day for singing, don't you think?", "Don't mind the children, they're in their own little world." ]
					}
				],
				[
					{
						"message": "I am Amber. I've lived here in Woodshine all my life, and I don't intend to leave."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Ever since my husband passed, I've made it my mission to give my children as peaceful a life as I can."
					}
				],
				[
					{
						"message": "This is the ancestral home of the Kariba. For thousands of years, our tribe have lived and gathered here in peaceful symbiosis with the Mother Worm."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Lately it's been declining. We've suffered numerous attacks and kidnappings from Skycorps dogs, and our men have been disappearing or dying trying to fight back."
					}
				],
				[
					{
						"message": "She is the one true constant in our lives."
					},
					{
						"message": "The Mother is our guardian and our warmth, and it is our duty as a tribe to protect her and sing to her. Every day that Skycorps uses her to harvest precious minerals brings us closer to the end."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "There is not much I can do but sing and pray. I think it comforts her to hear our voices, however quiet."
					}
				]
			]
		}
	},
	"jimmy": {
		"1": {
			"output": 2,
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "I was held hostage my Skycorps."
					}
				],
				[
					{
						"codes": [ [ 1, 2 ] ],
						"message": "None at all..."
					}
				]
			],
			"suite": [
				[
					{
						"message": "Nani!"
					},
					{
						"message": "Could it be...?"
					},
					{
						"message": "Oh, how I feared I would never see you again..."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Where have you been all this time?"
					}
				],
				[
					{
						"message": "And here I was hoping you'd get caught up in less mischief than your brother..."
					},
					{
						"message": "If only your mother could have lived to help me raise you two."
					},
					{
						"codes": [
							[ 13, 8, 407 ]
						],
						"message": "Anyway, it is good to have you home again, despite the circumstances."
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Have you any word of your brother?"
					}
				],
				[
					{
						"message": "Alas, then, it is as I feared."
					},
					{
						"message": "Please, do what you can to bring him home, will you?"
					}
				]
			]

		},
		"2": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "What are we doing about Skycorps?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Where might Loth be?"
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Can you allow me passage to Pioneer Trail?"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"messages": [ "Oh, Nani!", "How is my daughter doing?", "Welcome home, my child." ]
					}
				],
				[
					{
						"message": "As much as we can. They are a force to be reckoned with, but luckily Woodshine is still small potatoes to them."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Regrettably, though, it seems they will stop at nothing to find Loth. Your brother has done a very grave thing, Nani..."
					}
				],
				[
					{
						"message": "I know just as much as you do. Your brother was doing some digging around the ancient Kariba burial grounds with his human girlfriend and that old Grand island professor, until one day he stole the Island Key and disappeared."
					},
					{
						"message": "An artifact of such great power belongs in the hands of no mortal, I can assure you. I fear your brother is heading down a very dangerous path, and if you don't find him soon he may be a lost cause."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Maybe he's headed for the Mother Worm herself. After all, he has been a vehement worshipper for as long as he could talk."
					}
				],
				[
					{
						"message": "Oh, is old Ward giving you a hard time?"
					},
					{
						"message": "If you're ever to find your brother and bring him to his senses, I'll be the last to stand in your way."
					},
					{
						"codes": [
							[ 2, 40 ]
						],
						"message": "Here, take this."
					},
					{
						"codes": [
							[ 1, 0 ]
						],
						"message": "That ought to convince him to open the gates for you."
					}
				]
			]
		}
	},
	"billy": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"message": "Hnnngh..."
					}
				]
			]
		}
	},
	"nani": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"message": "So, what does any of this have to do with me?"
					}
				]
			]
		}
	},
	"lyle": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"messages": [ "Who're you, mister?", "Wanna play Hide n' Peek?", "Is that a real gun?" ]
					}
				]
			]
		}
	},
	"dale": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"messages": [ "Wanna play?", "You're tall.", "Bet you can't catch me!" ]
					}
				]
			]
		}
	},
	"lucie": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"messages": [ "Mom hasn't been herself lately...", "Are you going to stay around for a while?", "There are no other girls around for me to play with." ]
					}
				]
			]
		}
	},
	"gaia": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"messages": [ "I don't suppose you've seen my husband?", "Nani... it's been a while, huh?", "My cats are going crazy again..." ]
					}
				]
			]
		}
	},
	"bit": {
		"1": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Sure."
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "I had better get going..."
					}
				]
			],
			"suite": [
				[
					{
						"message": "..."
					},
					{
						"message": "Psst... Hey!"
					},
					{
						"message": "Hey, you!"
					},
					{
						"message": "I don't know how you managed to escape your cell, but, er... I'm still in a bit of a bind here myself."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Would you help me out?"
					}
				],
				[
					{
						"message": "I appreciate it... you know, I'll owe you big time if you can manage to get me outta here."
					},
					{
						"message": "You might find the key to this cell lying around the ship somewhere."
					},
					{
						"message": "If you do, you should be able to use it on that there door and let me free!"
					}
				],
				[
					{
						"message": "Well uh... okay. If you change your mind, you'll know where to find me."
					}
				]
			]
		},
		"2": {
			"responses": [
				[
					{
						"message": "Where are we?"
					}
				]
			],
			"suite": [
				[
					{
						"message": "Listen, I don't wanna rush you, but..."
					},
					{
						"message": "I'm starting to get pretty hungry, and I haven't seen the jailer in a few days..."
					}
				],
				[
					{
						"message": "I'm not gonna sugarcoat it. We're in prison."
					},
					{
						"message": "Why you're here, I couldn't tell ya, but I was here way before that, and it's for no good reason!"
					},
					{
						"message": "You see, there was a hostile takeover of this place, or something like it anyway, and the old crew were either conscripted or thrown overboard to die in the clouds below."
					},
					{
						"message": "For some reason, they thought I was too useless to join their crew, but not important enough to kill, so they just left me in here."
					}
				]
			]
		},
		"3": {
			"responses": [],
			"suite": [
				[
					{
						"message": "Careful out there, by the way. There's a ton of security guards and booby traps and the like. If you get gunned down, don't say I didn't warn ya."
					}
				]
			]
		},
		"4": {
			"responses": [],
			"suite": [
				[
					{
						"message": "I can't believe it... You actually did it!"
					},
					{
						"message": "I really can't thank you enough..."
					},
					{
						"message": "Heh, like I said... I owe you big time!"
					}
				]
			]
		},
		"5": {
			"responses": [],
			"suite": [
				[
					{
						"message": "..."
					},
					{
						"message": "I, er... I'll have to gather some stuff here before I head out. But I'll be right behind ya!"
					}
				]
			]
		},
		"6": {
			"responses": [],
			"suite": [
				[
					{
						"message": "Listen, I don't exactly have much to give you right now."
					},
					{
						"message": "I'm sure you understand..."
					},
					{
						"message": "But! Fear not! If we bump into each other again someday, I'll have something for you!"
					}
				]
			]
		},
		"7": {
			"responses": [],
			"suite": [
				[
					{
						"message": "Heh... See ya around!"
					}
				]
			]
		},
		"8": {
			"responses": [],
			"suite": [
				[
					{
						"message": "Thanks again for helping me. Stay safe out there!"
					}
				]
			]
		},
		"9": {
			"responses": [],
			"suite": [
				[
					{
						"message": "I can't believe it... You actually did it!"
					},
					{
						"message": "I really can't thank you enough, stranger!"
					},
					{
						"message": "Heh, I guess I owe you big time!"
					}
				]
			]
		}
	},
	"bryn": {
		"1": {
			"output": 2,
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "What are you doing in this place?"
					}
				],
				[
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Technology...?"
					}
				],
				[
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Uhhh..."
					}
				],
				[
					{
						"codes": [ [ 1, 4 ] ],
						"message": "What happened on Firstwind?"
					},
					{
						"codes": [ [ 1, 5 ] ],
						"message": "I'm looking for my brother."
					},
					{
						"codes": [ [ 1, 6 ] ],
						"message": "Let's leave."
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 5, 1 ] ],
						"message": "Well, I'll be honest, you're about the last person I was expecting to see down here."
					},
					{
						"codes": [
							[ 1, 0 ],
							[ 5, 0 ],
							[ 1, 0 ]
						],
						"message": "I was beginning to think I'd never see anyone again."
					}
				],
				[
					{
						"message": "It's... a long story. But I signed up for it, really."
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Sometimes, if you want to study ancient peoples, you might end up getting captured by their ancient technology."
					}
				],
				[
					{
						"message": "Well, that's what Doc Willett and I think it might be."
					},
					{
						"codes": [ [ 5, 1 ] ],
						"message": "I don't know, it's hard to tell. But don't you think these creatures are rather fascinating?"
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "..."
					},
					{
						"codes": [ [ 5, 2 ] ],
						"message": "Look at me, rambling."
					},
					{
						"codes": [ [ 9, 20001, 1 ] ],
						"message": "I can't believe you made it off Firstwind alive!"
					},
					{
						"codes": [
							[ 5, 1 ],
							[ 1, 2 ]
						],
						"message": "Wait... is that my gun?!"
					}
				],
				[
					{
						"codes": [ [ 5, 0 ] ],
						"message": "No matter. We need to get out of this place and back to the base."
					},
					{
						"codes": [
							[ 9, 420 ],
							[ 13, 0, 420 ]
						],
						"message": "I presume you've already stumbled into Dr. Willett if you decided to come poking around these ruins."
					},
					{
						"codes": [ [ 2, 115 ] ],
						"message": "Oh, and by the way, take this relic I found."
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "It supposedly grants you the power to cling onto and jump off of walls. I hope you find it useful."
					}
				],
				[
					{
						"codes": [ [ 5, 0 ] ],
						"message": "Another long story, but that one I at least owe it to tell you..."
					},
					{
						"message": "Willett and I were taking her over from Grand Island to do some research in places just like these."
					},
					{
						"message": "Then, one night, we and our crew were raided by pirates - or, what we thought were pirates."
					},
					{
						"message": "Turns out, it was Skycorps. Lady Nimbus and Doc still have some bad blood or whatever, so she sent her goons to come kill us."
					},
					{
						"codes": [ [ 5, 1 ] ],
						"message": "Luckily Doc had an escape plan, but unfortunately that plan didn't include you or anyone else on the crew."
					},
					{
						"message": "Skycorps had already tossed most of us in holding cells, but Doc and I were wanted by higher-ups, so they kept us in the bridge."
					},
					{
						"message": "I didn't really know what to do... I was too scared to stay behind, but I couldn't just abandon you either."
					},
					{
						"message": "I decided the least I could do was try to pass along a message so that you might have some chance to escape, and so I had someone from our crew hide a note in your food."
					},
					{
						"codes": [
							[ 5, 2 ],
							[ 1, 3 ]
						],
						"message": "I presume you got the message, otherwise we wouldn't be having this conversation."
					}
				],
				[
					{
						"codes": [ [ 5, 0 ] ],
						"message": "Aren't we all?"
					},
					{
						"message": "...sigh..."
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "God, I miss him, despite everything he did. I just want to know if he's still alive..."
					}
				],
				[
					{
						"message": "You go ahead. I need to gather a few artifacts for study first."
					},
					{
						"codes": [ [ 5, 2 ] ],
						"message": "Don't worry about me--you've taken care of all the threats, and I know the way home!"
					}
				]
			]
		},
		"2": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "What happened on Firstwind?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "What do you know about my brother?"
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Tell me about these ruins."
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"messages": [ "Yeah?", "What's up?", "It's been awful lonely down here..." ]
					}
				],
				[
					{
						"message": "Another long story, but that one I at least owe it to tell you..."
					},
					{
						"message": "Willett and I were taking her over from Grand Island to do some research in places just like these."
					},
					{
						"message": "Then, one night, we and our crew were raided by pirates--or, what we thought were pirates."
					},
					{
						"message": "Turns out, it was Skycorps. Lady Nimbus and Doc still have some bad blood or whatever, so she sent her goons to come kill us."
					},
					{
						"message": "Luckily Doc had an escape plan, but unfortunately that plan didn't include you or anyone else on the crew."
					},
					{
						"message": "Skycorps had already tossed most of us in holding cells, but Doc and I were wanted by higher-ups, so they kept us in the bridge."
					},
					{
						"message": "I didn't really know what to do... I was too scared to stay behind, but I couldn't just abandon you either."
					},
					{
						"message": "I decided the least I could do was try to pass along a message so that you might have some chance to escape, and so I had someone from our crew hide a note in your food."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "I presume you got the message, otherwise we wouldn't be having this conversation."
					}
				],
				[
					{
						"message": "Well, no one knows where he went or what his plans are."
					},
					{
						"message": "He had stolen an artifact from Doc--not sure which one, but that hardly matters--and ran away."
					},
					{
						"message": "He gave us no warning, and I struggle to piece together what his motive could have been..."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Ugh, I don't know. He's really protective of Kariba stuff, and understandably so, but I just can't wrap my mind around that kind of betrayal."
					}
				],
				[
					{
						"message": "They are the ruins of the ancient Kariba. Your ancestors."
					},
					{
						"message": "This one in particular is the most intact that we currently know about, and it's become clear to me that it's also the most active."
					},
					{
						"message": "The rhenite energy that fills these chambers is almost too much for a human like me to stomach."
					},
					{
						"message": "Anyhow, I came to study these strange beings that you've no doubt encountered in great number."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "I believe they are hiding a deep truth about our world and about this fabulous island, and I am intent on discovering what that is."
					}
				]
			]
		},
		"3": {
			"output": 2,
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "What was that thing I just fought?"
					}
				],
				[
					{
						"codes": [ [ 1, 2 ] ],
						"message": "What is rhenite, exactly?"
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "We should probably get out of here..."
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 5, 0 ] ],
						"message": "Nani... I was hoping to find you here in one piece."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "I was a bit too proud to admit it before, but... I was trapped here. So... you kind of saved my life."
					}
				],
				[
					{
						"codes": [ [ 5, 1 ] ],
						"message": "That was King Miaag. Or, whatever was left of him."
					},
					{
						"message": "In his later years he became consumed by the intoxicating energy produced by rhenite crystals."
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "It is the same energy that inhabits the creatures of this ruin, and of the Overturned Forest."
					},
					{
						"message": "And, in fact, I believe it to be what Skycorps is using to mutate their Ooplo servants, and to do who knows whatever else."
					},
					{
						"codes": [ [ 5, 1 ] ],
						"message": "Miaag here was surely one of rhenite's first victims. And just look what it turned him into..."
					},
					{
						"message": "I could be wrong, but I suspect the reason these ruins are more or less off-limits is that the Kariba wanted to hide the truth about Miaag. Perhaps from Skycorps and Grand-Islanders, or perhaps from everyone altogether."
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "But it's hard to say for sure, really."
					}
				],
				[
					{
						"codes": [ [ 5, 0 ] ],
						"message": "It's a compound formed by the Mother Worm."
					},
					{
						"message": "Since the dawn of this island, its inhabitants have lived in symbiosis with the Mother Worm. The Kariba and other tribes perform rituals and sing songs to the Mother, and in return she produces rhenite, which gives life and energy to the island."
					},
					{
						"message": "Rhenite has since been used, abused, locked away, worshipped, stolen, returned... It's quite the commodity of interest around here, despite the other equally marvellous things the Mother produces."
					},
					{
						"codes": [ [ 5, 1 ] ],
						"message": "And these are not just stories - it is all substantiated through old texts and stone tablets that we've found in the ancient ruins of this forest."
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "If this is all novel to you, Nani, you should speak to your father about it. Doubtless he's told you before, but it seems like your memory is a bit out of whack since Skycorps took Firstwind."
					},
					{
						"codes": [ [ 13, 0, 509 ] ],
						"message": "I really hope they didn't torture you or anything..."
					}
				],
				[
					{
						"codes": [ [ 5, 2 ] ],
						"message": "You're right. I'm rambling again."
					},
					{
						"codes": [
							[ 13, 0, 509 ],
							[ 5, 1 ]
						],
						"message": "You know what, I'll hang around for a little longer. I'm interested to find any clues that Miaag and his people might have left behind in this place."
					}
				]
			]
		},
		"4": {
			"responses": [],
			"suite": [
				[
					{
						"message": "You go on ahead. I'd like to do a bit more digging."
					},
					{
						"message": "Head back to the old pioneers' base where you met Doc. I'll meet you there!"
					}
				]
			]
		},
		"5": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Sure."
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "I'd rather keep this one..."
					}
				]
			],
			"suite": [
				[
					{
						"codes": [
							[ 5, 2 ],
							[ 3, 9, 1, 301 ]
						],
						"message": "Welcome back!"
					},
					{
						"codes": [ [ 13, 0, 300 ] ],
						"message": "Listen, I can't thank you enough for getting me out of those ruins."
					},
					{
						"codes": [
							[ 5, 1 ]
						],
						"message": "If you ever need help with anything, or want to learn more about the Ancient Kariba, I'll be here!"
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "By the way, I'd love to get my gun back if you don't mind. I have a decent replacement for it that we nabbed from a Skycorps thug, so you won't have to go unarmed. But I get it if you want to keep mine, too. After all, I'm the one who left it behind."
					},
					{
						"codes": [
							[ 5, 1 ],
							[ 1, 0 ]
						],
						"message": "So, what do you say? Do you want to trade guns?"
					}
				],
				[
					{
						"codes": [
							[ 5, 2 ],
							[ 16, 0 ]
						],
						"message": "That means a lot, really!"
					},
					{
						"codes": [
							[ 5, 1 ],
							[ 15, 1 ],
							[ 3, 9, 1, 300 ]
						],
						"message": "Here, as promised..."
					}
				],
				[
					{
						"codes": [ [ 5, 0 ] ],
						"message": "It's hard to blame you, really. That old pistol is one-of-a-kind, and I imagine you've grown just as attached to it as I had."
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "Well, if you ever decide to change your mind, I'm here."
					}
				]
			]
		},
		"6": {
			"responses": [
				[
					{
						"codes": [ [ 1, 4 ] ],
						"message": "Aren't you tired of hiding?"
					},
					{
						"codes": [ [ 1, 5 ] ],
						"message": "Tell me about the Ancient Kariba."
					},
					{
						"contingencies": [
							{
								"requirement": 1,
								"strict": true,
								"tag": "obtain_wasp"
							}
						],
						"codes": [ [ 1, 1 ] ],
						"message": "I'd like to give you back your gun."
					}
				],
				[
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Yes."
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "On second thought..."
					}
				],
				[
					{
						"codes": [ [ 1, 6 ] ],
						"message": "What are Skycorps doing, exactly?"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [
							[ 1, 0 ],
							[ 5, 2 ],
							[ 3, 9, 1, 301 ]
						],
						"messages": [ "It's good to see you again!", "What's up?" ]
					}

				],
				[
					{
						"codes": [
							[ 1, 1 ],
							[ 5, 2 ]
						],
						"message": "Oh, awesome! Are you sure?"
					}

				],
				[
					{
						"codes": [
							[ 5, 2 ],
							[ 16, 0 ]
						],
						"message": "That means a lot, really!"
					},
					{
						"codes": [
							[ 5, 1 ],
							[ 15, 1 ],
							[ 3, 9, 1, 300 ]
						],
						"message": "Here, as promised..."
					}
				],
				[
					{
						"codes": [ [ 5, 0 ] ],
						"message": "It's hard to blame you, really. That old pistol is one-of-a-kind, and I imagine you've grown just as attached to it as I had."
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "Well, if you ever decide to change your mind, I'm here."
					}
				],
				[
					{
						"codes": [ [ 5, 0 ] ],
						"message": "Of course... It's easy to get bored around here."
					},
					{
						"codes": [ [ 5, 2 ] ],
						"message": "I mean, why do you think I throw myself into dangerous ruins?"
					},
					{
						"codes": [
							[ 5, 1 ],
							[ 1, 0 ]
						],
						"message": "Living with Doc is great and all, but it gets old. And I really wish he'd stop leaving his dentures next to my makeup..."
					}
				],
				[
					{
						"codes": [ [ 5, 0 ] ],
						"message": "Well, they're your ancestors. And much like you and your tribe, they've called the Overturned Forest their home since as far back as written records go."
					},
					{
						"codes": [ [ 5, 1 ] ],
						"message": "They worshipped the Mother Worm and performed rituals to maintain her deep hibernation."
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "I'm not sure if they were afraid of what the Mother would do if she woke up, or if they merely did it out of reverence for the creature."
					},
					{
						"message": "All I know is, I am personally very afraid of what might happen if the worm wakes up, and I'm equally afraid of what would happen if she died."
					},
					{
						"message": "I suppose that's all to say that I support the Ancient Kariba mentality, to live in harmony with the worm. Maybe I'm biased because of all the research I've done."
					},
					{
						"codes": [
							[ 5, 1 ],
							[ 1, 2 ]
						],
						"message": "They would all surely be rolling in their graves to know what Skycorps have been doing..."
					}
				],
				[
					{
						"codes": [ [ 5, 1 ] ],
						"message": "They've been riling up the worm, basically. The closer she is to waking up, the more rhenite she produces."
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "Skycorps are playing with fire. They know next to nothing about the worm and her physiology, and I imagine that even if they did, they wouldn't slow rhenite production one bit."
					},
					{
						"message": "I'm not really sure I understand them, to be honest. Why can't they just plug along with the Nightside Projects and leave the Kariba and the Mother Worm alone?"
					},
					{
						"codes": [
							[ 5, 1 ],
							[ 1, 0 ]
						],
						"message": "I should stop worrying so much... but it's easy to get lost in your thoughts when you stay cooped up in an old fort all day..."
					}
				]
			]
		},
		"10": {
			"responses": [],
			"suite": [
				[
					{
						"message": "Yeah... It's as bad as it sounds."
					},
					{
						"message": "Lady Nimbus has amassed a force of thousands of soldiers, and she plans to revive the failed Nightside Projects."
					},
					{
						"message": "Originally we assumed their return to this island was a routine one. You know, maintenance and construction for whatever stuff has yet to be abandoned."
					},
					{
						"codes": [ [ 8, 0 ] ],
						"message": "But Doc has some deeper intel."
					}
				]
			]
		},
		"11": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "How will I know what to do?"
					}
				]
			],
			"suite": [
				[
					{
						"message": "It's an old mining town, and one of the few remaining human colonies on this island."
					},
					{
						"message": "There, you'll meet with an old classmate of mine named Spencer."
					},
					{
						"message": "He might be the only person on this whole island who can recover the Greatwing blueprints from that disc."
					},
					{
						"message": "I know it's a bit of a far-fetched task, and Doc and I don't have any expectations of you. I mean, I already owe you my life."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "But this is the best we could come up with. A last-ditch effort to stop Skycorps before it's too late..."
					}
				],
				[
					{
						"message": "We'll radio to you every step of the way, as long as we can reach you. Some areas have better reception than others, so you'll be on your own quite a lot."
					},
					{
						"codes": [ [ 2, 42 ] ],
						"message": "Here."
					},
					{
						"message": "This is a field telephone that the pioneers used to use. I know it's a little old-fashioned, but it's all we had lying around."
					},
					{
						"codes": [ [ 8, 0 ] ],
						"message": "With this, Doc and I can call you if we think you need help."
					}
				]
			]
		},
		"20": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "It wasn't too bad!"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "My life flashed before my eyes..."
					}
				],
				[
					{
						"codes": [ [ 8, 0 ] ],
						"message": "Something like that."
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Nani! I'm glad you made it up here okay. Those old nighthawks can be pretty terrifying if you're not used to them."
					}
				],
				[
					{
						"message": "Well, that's good to hear!"
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Anyway, it's great to see you again! What's it been...? Two years?"
					}
				],
				[
					{
						"message": "Hard to blame you, really."
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Anyway, it's great to see you again! What's it been...? Two years?"
					}
				]
			]
		},
		"21": {
			"responses": [
			],
			"suite": [
				[
					{
						"codes": [ [ 8, 0 ] ],
						"message": "..."
					}
				]
			]
		},
		"22": {
			"responses": [
				[
					{
						"codes": [ [ 8, 0 ] ],
						"message": "Where is my brother?"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"message": "It's as I feared, then."
					}
				]
			]
		},
		"23": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Blindsided by what?"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"message": "We don't really know. We were just as blindsided as you are."
					}
				],
				[
					{
						"codes": [ [ 8, 0 ] ],
						"message": "Nani, your brother is missing..."
					}
				]
			]
		},
		"24": {
			"responses": [
			],
			"suite": [
				[
					{
						"codes": [ [ 8, 0 ] ],
						"message": "Doc?! What is that?"
					}
				]
			]
		}
	},
	"carl": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"codes": [ [ 3, 17 ] ],
						"message": "What in the heck are my eyes seein' right now...?"
					},
					{
						"message": "Now, I ain't know how you snuck your way down here, but I'm tellin' you now, it was a bad idea."
					},
					{
						"codes": [ [ 13, 17, 110 ] ],
						"message": "The ship's goin' down, little lady."
					},
					{
						"message": "If I was you I'd find the nearest escape hatch and go for a swim in the clouds."
					},
					{
						"message": "Say, would you grab me a soda if you got nothin' else to do?"
					}
				]
			]
		},
		"2": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Who are you?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "What is this place?"
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Tell me about Skycorps."
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"message": "So... Any updates on that soda?"
					}
				],
				[
					{
						"message": "Name's Carl. I'm guardin' the cargo here, and my shift doesn't end for another six months."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "I'm a simple man. I have a job to do, and I'm gon' do it until it's done. Even if it kills me."
					}
				],
				[
					{
						"message": "Why, it's the cargo room! Unless you were speakin' in more general terms, in which case, this is the Firstwind."
					},
					{
						"message": "She's an old research vessel that Skycorps... er... borrowed."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Anyhow, I been livin' and workin' here for the better part of three months on a long-term contract, as they call it."
					}
				],
				[
					{
						"message": "You know, I ain't never heard of 'em until they came and busted down my front door and took me prisoner. As much as I wasn't happy about that, they've been treating me alright. I make lots more money than I ever did before."
					},
					{
						"message": "But lemme tell ya, I sure do miss my dog."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Anyhow, they force me to sit in this cargo hold all day to make sure no one steals anything. Say, now that I mention it, don't go tamperin', ya got that?"
					}
				]
			]
		}
	},
	"dr_go": {
		"1": {
			"responses": [ [] ],
			"suite": [
				[
					{
						"codes": [ [ 3, 2, 16 ] ],
						"message": "Oh!"
					},
					{
						"message": "I wasn't expecting a Kariba to stroll in here."
					},
					{
						"codes": [ [ 13, 16, 114 ] ],
						"message": "Are you sick?"
					}
				]
			]
		},
		"2": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Who are you?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "What's going on?"
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Where am I?"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"messages": [ "Yes?", "How can I help you?" ]
					}
				],
				[
					{
						"message": "I'm Dr. Go."
					},
					{
						"message": "I was enlisted by Skycorps some years ago, and they assigned me here against my will."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "No matter. I will do my duties here until I am relieved of them, or some other end befalls us."
					}
				],
				[
					{
						"message": "We're not entirely certain, as the crew have a tendency to forget we exist, and as such they don't tell us much."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "But from what I've heard through passing transmissions, this ship is enduring high-altitude storms beyond her capacity."
					}
				],
				[
					{
						"message": "This is the infirmary."
					},
					{
						"message": "Here, Mirin and I take care of the sick amongst our crew. It's been a rough couple of weeks since the storms started hitting, and these days I'm not even sure if the pilot is still around."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Perhaps they all escaped and left us here to die."
					}
				]
			]
		}
	},
	"dr_willett": {
		"1": {
			"output": 2,
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "It sure is."
					}
				],
				[
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Bryn left me a note."
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "I had to fight my way out."
					}
				],
				[
					{
						"codes": [ [ 1, 4 ] ],
						"message": "I can try to find her."
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 14, 0 ] ],
						"message": "..."
					},
					{
						"codes": [ [ 14, 1 ] ],
						"message": "Good heavens, you scared me half to death. I don't know if my old heart can take many more such frights."
					},
					{
						"message": "Wait a second..."
					},
					{
						"message": "Do my eyes deceive me?"
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Is that really you, Nani?"
					}
				],
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Well, I can't say I understand just how you got yourself off that ship, but I am impressed nonetheless."
					}
				],
				[
					{
						"message": "Ah, yes... Bryn. My courageous student."
					},
					{
						"message": "A touch too courageous, if you ask me!"
					},
					{
						"message": "The darling thing is trapped in a ruin."
					},
					{
						"message": "Again."
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "I haven't had a transmission from her in a few days now, so I am beginning to worry."
					}
				],
				[
					{
						"message": "I hadn't even noticed, you've got a gun!"
					},
					{
						"message": "Let me see..."
					},
					{
						"message": "Yes, I know this weapon. It belongs to Bryn, my courageous student."
					},
					{
						"message": "A touch too courageous, if you ask me!"
					},
					{
						"message": "The darling thing is trapped in a ruin."
					},
					{
						"message": "Again."
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "I haven't had a transmission from her in a few days now, so I am beginning to worry."
					}
				],
				[
					{
						"message": "That would be excellent. Despite what it may seem, these old knees aren't much fit for spelunking!"
					},
					{
						"message": "Oh, before you go..."
					},
					{
						"codes": [ [ 2, 18 ] ],
						"message": "Have a look at this. It seems like it connects perfectly with that gizmo you've got at your hip!"
					},
					{
						"message": "With that, you should be able to track your lifeforce and see any gear you might be wearing."
					},
					{
						"codes": [ [ 13, 2, 300 ] ],
						"message": "Maybe it's not terribly useful for you, but it's taking up valuable space on my workbench."
					}
				]
			]
		},
		"2": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Where are the ruins?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "What is this place?"
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "I'm curious..."
					}
				],
				[
					{
						"codes": [ [ 1, 4 ] ],
						"message": "Do you know where my brother is?"
					},
					{
						"codes": [ [ 1, 5 ] ],
						"message": "Tell me about Bryn."
					},
					{
						"codes": [ [ 1, 6 ] ],
						"message": "Tell me about Skycorps."
					}
				],
				[
					{
						"codes": [ [ 1, 7 ] ],
						"message": "Caroline?"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"messages": [ "So... Any luck finding Bryn?", "What's on your mind?" ]
					}
				],
				[
					{
						"message": "The ruins are southeast of here. You might need to do a bit of acrobatics to get there if you take the low road - in some areas, the overturned forest hangs precariously above the clouds."
					},
					{
						"message": "Alternatively, you can take the high road, which ought to be a much safer and easier journey."
					},
					{
						"message": "However, I must warn you! The ruins are a very dark and sinister place. You mustn't venture inside without a lantern!"
					},
					{
						"message": "I don't have one myself to give you, but you ought to be able to buy one in Woodshine Village. So head there first if you haven't already."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "You should have no trouble finding Woodshine if you head east and a bit north from here. Though I imagine you might know the way, considering you've lived there your whole life."
					}
				],
				[
					{
						"message": "This is an old base established by the long-dead pioneers who first discovered this island."
					},
					{
						"message": "From what I gathered about what they left behind, they used it as an outpost of sorts to defend and hide against the native tribes who did not want them here."
					},
					{
						"message": "I imagine that, after some time, they were either killed by the natives or simply died from a lack of resources."
					},
					{
						"message": "Anyway, it seemed like the perfect spot for me and Bryn to find shelter after crash-landing in our escape pod."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "We've been here for some months, now, ever on the run from Skycorps."
					}
				],
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Tell me what you'd like to know."
					}
				],
				[
					{
						"message": "Well, that's a sore topic, to say the very least."
					},
					{
						"message": "He stole a priceless artifact and ran off with it."
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "If you ever do find him, could you let him know that I'd like it back?"
					}
				],
				[
					{
						"message": "Bryn is the brightest and hardest-working student I've ever met, apart perhaps from your brother."
					},
					{
						"message": "But forgive me if I hesitate to laud him after the incident."
					},
					{
						"message": "Anyway, Bryn was in my 'Anthropology of Ancient Peoples' seminar over on Grand Island some years back, and she's been joining me here on post-graduate expeditions to study the Ancient Kariba."
					},
					{
						"message": "She's grown quite attached to her studies recently."
					},
					{
						"message": "She reminds me a lot of myself when I was her age, in fact."
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Let's just hope she doesn't make the same mistake I made and let some money-hungry corporation take advantage of her brilliant mind."
					}
				],
				[
					{
						"message": "It's a mega-corporation that frankly doesn't know what it wants to be anymore."
					},
					{
						"message": "You might be surprised to know that I was its co-founder."
					},
					{
						"message": "Yes, that's right, co-founder!"
					},
					{
						"message": "But some years ago, Caroline and I had some disagreements about the company's mission, so I stepped down and opted to conduct some research on my own."
					},
					{
						"message": "Ever since, Caroline and her indentured goons have been hunting me down and trying to steal the research that is rightfully mine."
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "It seems that's all anyone wants to do these days."
					}
				],
				[
					{
						"message": "Lady Nimbus. Skycorps's CEO."
					},
					{
						"message": "She would have done better to just leave me alone, but it's too late now."
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "I will take her and all of Skycorps down after what they've done!"
					}
				]
			]
		},
		"3": {
			"output": 2,
			"responses": [],
			"suite": [
				[
					{
						"message": "I owe you my deepest gratitude for rescuing my student."
					},
					{
						"message": "And Bryn filled me in on all the details, about the corrupted King Miaag that you defeated. Well done."
					},
					{
						"codes": [ [ 21, 300 ] ],
						"message": "Anyway, you've arrived at just the right time, as we've got pressing matters to discuss with you. Let's waste no more time."
					}
				]
			]
		},
		"20": {
			"output": 2,
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "I guess he kinda looks like my grandpa?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Yeah... You know, my brother and I used to explore that place when I was a kid."
					}
				]
			],
			"suite": [
				[
					{
						"message": "...And here we have a marble bust of the great King Miaag."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Hmm... I think I see a slight resemblance...?"
					}
				],
				[
					{
						"message": "Hah! I kid, of course."
					},
					{
						"message": "We excavated this one from the Kariba burial grounds in the deep forest, and we took great care not to disturb any of the neighboring graves."
					},
					{
						"message": "Wouldn't want any Ancient Kariba spirits on our bad side, now would we?"
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "So, as you can see, ours is a more noble pursuit than that of Skycorps. We aim to study and appreciate your people, not evict them."
					}
				],
				[
					{
						"message": "Ah, delightful! Yes, your brother... he truly has been such a valuable asset to our research team."
					},
					{
						"codes": [ [ 8, 0 ] ],
						"message": "I do wonder - has he shared much with you about his recent ventures?"
					}
				]
			]
		},
		"21": {
			"output": 2,
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "...My brother?"
					},
					{
						"codes": [ [ 8, 0 ] ],
						"message": "What are you talking about? My brother is with you..."
					}
				]
			],
			"suite": [
				[
					{
						"message": "The time does seem to race by when you're doing hands-on research, hm?"
					},
					{
						"message": "..."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "As I was saying before... I wonder if your brother has shared any of his findings with you...?"
					}
				],
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Yes... I imagine you've seen him in recent days, no?"
					}
				]
			]
		},
		"22": {
			"output": 2,
			"responses": [
			],
			"suite": [
				[
					{
						"codes": [ [ 8, 0 ] ],
						"message": "...Mh...Yes, indeed. He is! Or, he was..."
					}
				]
			]
		},
		"23": {
			"output": 2,
			"responses": [
				{
					"codes": [ [ 8, 0 ] ],
					"message": "What is going on?"
				}
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Well, that is essentially why we invited you here today. We were hoping that you'd be able to tell us where he is."
					}
				]
			]
		},
		"25": {
			"output": 2,
			"responses": [
			],
			"suite": [
				[
					{
						"message": "Not to worry, of course! I am sure he fares well and will be coming back any day now."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "So? Have you any idea where he might have gone?"
					}
				]
			]
		},
		"26": {
			"output": 2,
			"responses": [
			],
			"suite": [
				[
					{
						"message": "Oh, my..."
					},
					{
						"codes": [ [ 8, 0 ] ],
						"message": "I think we need to get out of here!"
					}
				]
			]
		},
		"10": {
			"output": 2,
			"responses": [
				[
					{
						"codes": [ [ 8, 0 ] ],
						"message": "Wait... a hostile takeover?"
					}
				]
			],
			"suite": [
				[
					{
						"message": "So, as you may or may not be aware, Skycorps are headed toward this island as we speak."
					},
					{
						"message": "To call it a hostile takeover might be an understatement."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "As such, we have limited time to spare, and we must stop at nothing to foil their plans."
					}
				]
			]
		},
		"11": {
			"output": 2,
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "How can we stop them?"
					}
				],
				[
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Why are you giving it to me?"
					}
				],
				[
					{
						"codes": [ [ 8, 0 ] ],
						"message": "Ashtown?"
					}
				]
			],
			"suite": [
				[
					{
						"message": "Precisely. Despite living in hiding, I still have secret remote access to some of Skycorps's servers."
					},
					{
						"message": "There are plans to vastly increase the production of rhenite on this island. That means disrupting the delicate balance between the hibernating Mother Worm and all life on this island."
					},
					{
						"message": "Nani, for thousands of years your tribe have lived in harmony with the Mother Worm, and Skycorps are mere weeks away from destroying it."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Who knows the chaos that could ensue were they to succeed..."
					}
				],
				[
					{
						"message": "Well... I'll show you."
					},
					{
						"codes": [ [ 2, 4 ] ],
						"message": "..."
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "This unremarkable little floppy disc contains highly confidential blueprints to the Greatwing, which is Skycorps' mother ship."
					}
				],
				[
					{
						"message": "It is an enormous responsibility, I know..."
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "But if we wish to have any hope of stopping Skycorps from bringing this island to ruin, you must take these blueprints to Ashtown."
					}
				]
			]
		},
		"12": {
			"output": 2,
			"responses": [
			],
			"suite": [
				[
					{
						"message": "There is a train station on the outskirts of Forgetville that should have service to Ashtown. That ought to be the quickest way."
					},
					{
						"codes": [ [ 22, 810, 1 ] ],
						"message": "Here, I'll mark the station on your map."
					},
					{
						"message": "Best of luck to you, Nani."
					},
					{
						"codes": [ [ 8, 0 ] ],
						"message": "The fate of this island lies in your hands..."
					}
				]
			]
		},
		"13": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Where is Ashtown?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "How did you get the Greatwing blueprints?"
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Who is Spencer?"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"messages": [ "Bring that floppy disc to Spencer in Ashtown. It's our best shot at stopping Skycorps.", "People like you give me hope in this island.", "What do you need?" ]
					}
				],
				[
					{
						"message": "It's quite a ways east. I'm hoping the train station near Forgetville will still have service to it."
					},
					{
						"message": "You'll have to navigate the Skycorps junkyards to get there, but that should be doable if you were able to make it out of the Kariba ruins in one piece."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Just give us a ring if you need help."
					}
				],
				[
					{
						"message": "Well, I was Skycorps's co-founder. I was careful to put safeguards in place should I need access to any confidential files."
					},
					{
						"message": "And I was especially diligent when I saw the writing on the wall that Caroline and I would be going our separate ways."
					},
					{
						"message": "I downloaded the blueprints onto that disc before leaving the company. Unfortunately, the disc was damaged during our escape from Firstwind, so that really threw a monkey wrench into our plans."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Spencer should be able to fix it right up."
					}
				],
				[
					{
						"message": "He was another of my star pupils, and he's got a knack for computer stuff."
					},
					{
						"message": "He moved to Ashtown as a means to escape the Grand Island authorities. Apparently, he hacked into some top-secret security system..."
					},
					{
						"message": "Anyway, he is as much an enemy of Skycorps as we are, since they've got the Grand Island police wrapped around their finger."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "We can trust him. And even if we can't, we don't really have a choice anymore..."
					}
				]
			]
		}
	},
	"gobe": {
		"1": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "I'm just looking for a place to rest."
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "I'm looking for my older brother."
					}
				],
				[
					{
						"codes": [
							[ 1, 3 ],
							[ 13, 3, 212 ]
						],
						"message": "Sure thing!"
					}
				]
			],
			"suite": [
				[
					{
						"message": "..."
					},
					{
						"message": "Huh?"
					},
					{
						"message": "Oh! A lost girl wanders my way, hmm?"
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "It's not every day I see another friendly face around here. What's your story?"
					}
				],
				[
					{
						"message": "Well, you're welcome to this here farmhouse. It's been abandoned ever since Old Mimic passed, and so I've been stopping by every now and again to do some upkeep."
					},
					{
						"message": "Anyhow, I could really use some help. My dog got spooked by some creature and darted off into the woods."
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Could you go find him for me? The past weeks of hard travel have left me a bit tired."
					}
				],
				[
					{
						"message": "A lost brother, eh? Well, my heart aches to hear that."
					},
					{
						"message": "You know, there are others of your kind at Woodshine, east of here. It seems like it'd be a good place to start."
					},
					{
						"message": "Anyhow, I could really use some help. My dog got spooked by some creature and darted off into the woods."
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Could you go find him for me? The past weeks of hard travel have left me a bit tired."
					}
				],
				[
					{
						"codes": [ [ 2, 20 ] ],
						"message": "Now, that's awful kind. Here, take this. You'll need it if you want to properly wrangle him up."
					},
					{
						"codes": [ [ 13, 24, 247 ] ],
						"message": "He shouldn't be too far off. I know he loves running down big slopes, if that's any help."
					}
				]
			]
		},
		"2": {
			"responses": [
				[
					{
						"message": "Not yet..."
					}
				]
			],
			"suite": [
				[
					{
						"message": "So? Have you found my dog yet? I'm starting to get worried..."
					}
				],
				[
					{
						"message": "Well, if it's any help, he tends to climb to real high places when he's afraid."
					},
					{
						"message": "Good luck!"
					}
				]
			]
		},
		"3": {
			"responses": [
				[
					{
						"codes": [
							[ 1, 1 ],
							[ 19, 24 ],
							[ 3, 5, 1, 212 ]
						],
						"message": "Hey, don't mention it!"
					}
				],
				[
					{
						"codes": [ [ 20, 3 ] ],
						"message": "Sure, let's trade!"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Maybe later."
					}
				]
			],
			"suite": [
				[
					{
						"message": "Oh, Justin! My precious thing!"
					},
					{
						"message": "Well, you've really gone and done it, haven't you?"
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "I say, I was beginning to fear for this lil' guy's life. I owe you a great debt, friend!"
					}
				],
				[
					{
						"message": "Well, I've got to thank you somehow..."
					},
					{
						"codes": [ [ 13, 3, 212 ] ],
						"message": "Say, I'd be happy to trade some stuff with you. Normally I don't vend outside of Ashtown, but for you I'll make an exception!"
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "What do you say?"
					}
				],
				[
					{
						"message": "Alright then, I'll see ya around!"
					}
				]
			]
		},
		"4": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "I'd like to trade things with you."
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Who are you?"
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Where are we?"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"messages": [ "Yes?", "Good to see you again!", "Lost in the woods?", "Sometimes this place gives me the creeps..." ]
					}
				],
				[
					{
						"codes": [ [ 20, 3 ] ],
						"message": "Sure thing! Here's what I've picked up over the last few weeks..."
					}
				],
				[
					{
						"message": "I'm a surveyor of this land, and I've been exploring its farthest and darkest reaches for as long as I can remember."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Justin and I tend to find stuff along the way and pick it up, so if you're ever in the market for random junk, I'm your guy!"
					}
				],
				[
					{
						"message": "Well, the Overturned Forest, if ya ain't talkin' specifics. At least, that's what we Grand-Islanders call it."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "But shouldn't you know, anyhow? You're a Kariba after all, and, last I checked, all your kind come from here."
					}
				]
			]
		}
	},
	"hologus": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"codes": [ [ 4, 1 ] ],
						"message": "My Lady...?"
					},
					{
						"message": "I'm here. I have an unstable connection here, and I can barely hear you."
					},
					{
						"message": "I had to flee Firstwind."
					}
				]
			]
		},
		"2": {
			"responses": [],
			"suite": [
				[
					{
						"codes": [ [ 4, 3 ] ],
						"message": "My mask was compromised. And besides, the storms up here are ferocious."
					},
					{
						"message": "And I have even worse news..."
					},
					{
						"message": "The Kariba girl escaped."
					}
				]
			]
		},
		"3": {
			"responses": [],
			"suite": [
				[
					{
						"codes": [ [ 4, 5 ] ],
						"message": "I got nothing at all to say. She had a gun, and she's pretty nimble."
					},
					{
						"message": "I won't underestimate her again."
					},
					{
						"message": "And, by the way, it seems like her memories might be coming back, so I'd bet my next paycheck she's going to try to find her brother."
					}
				]
			]
		},
		"4": {
			"responses": [],
			"suite": [
				[
					{
						"codes": [
							[ 4, 2 ],
							[ 5, 1 ]
						],
						"message": "I set myself up for that one, I guess."
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "Anyway, do us both a favor and get someone else to deal with the Kariba for now."
					},
					{
						"message": "I'll need to properly prepare for the next time I fight her, if it comes to that."
					}
				]
			]
		}
	},
	"justin": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"message": "Barf! Barf!"
					}
				]
			]
		},
		"2": {
			"responses": [
				[
					{
						"codes": [
							[ 19, 24 ],
							[ 3, 5, 1, 247 ],
							[ 13, 3, 212 ]
						],
						"message": "(Take the dog)"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "(Leave the dog)"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Barf! Barf!"
					}
				],
				[
					{
						"message": "Grrr..."
					},
					{
						"message": "Barf!!"
					},
					{
						"message": "Barf, barf!"
					}
				],
				[
					{
						"message": "(Whine)"
					}
				]
			]
		},
		"3": {
			"responses": [],
			"suite": [
				[
					{
						"message": "Barf!"
					}
				]
			]
		}
	},
	"krub": {
		"1": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "I was held hostage by Skycorps."
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "You know, just... my usual thing."
					}
				],
				[
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Where can I find my dad?"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Ho, there! If it isn't Nani Ba come to pay us another visit. Where have you been?"
					}
				],
				[
					{
						"message": "No kidding! You were always up to some mischief, but that's a whole other level. Glad to see you're okay, anyhow."
					},
					{
						"codes": [
							[ 1, 1 ],
							[ 13, 26, 406 ]
						],
						"message": "Say, if you haven't payed your dad a visit yet, I'm sure he'd be thrilled to see you."
					}
				],
				[
					{
						"message": "Making trouble with your brother in the woods, then? Just as long as you stay out of those old ruins..."
					},
					{
						"codes": [
							[ 1, 1 ],
							[ 13, 26, 406 ]
						],
						"message": "Anyhow, if you haven't payed your dad a visit yet, I'm sure he'd be thrilled to see you."
					}
				],
				[
					{
						"message": "He should be in the town hall, like usual. No doubt he's worried sick about you."
					}
				]
			]
		},
		"2": {
			"responses": [],
			"suite": [
				[
					{
						"messages": [ "What can I do for ya?", "Everything alright?" ]
					}
				],
				[
					{
						"message": "Your brother was a real rascal growing up, lemme tell ya. He's gotten so much older now, but I still remember him as the brave boy he was."
					}
				],
				[
					{
						"message": "Even though you two were thirteen or so years apart, you were inseperable. Go talk to your dad about him, I'm sure he remembers much more than I do."
					}
				]
			]
		}
	},
	"lady_nimbus": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"message": "Gus... Gus...?"
					},
					{
						"message": "Gus, do you copy?"
					}
				]
			]
		},
		"2": {
			"responses": [],
			"suite": [
				[
					{
						"codes": [ [ 5, 1 ] ],
						"message": "Flee?!"
					},
					{
						"message": "What do you mean?"
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "The ship has been securely ours for months."
					}
				]
			]
		},
		"3": {
			"responses": [],
			"suite": [
				[
					{
						"codes": [ [ 5, 2 ] ],
						"message": "..."
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "It is unlike you to fail me so, Gus."
					}
				]
			]
		},
		"4": {
			"responses": [],
			"suite": [
				[
					{
						"message": "Your next paycheck isn't going to exist, I'm afraid."
					}
				]
			]
		},
		"5": {
			"responses": [],
			"suite": [
				[
					{
						"message": "I'll see to it that it won't."
					},
					{
						"message": "I have no interest in wasting any more time dealing with Nani."
					},
					{
						"codes": [ [ 5, 2 ] ],
						"message": "I'm sending Lynx after her, and that'll be the end of it."
					}
				]
			]
		}
	},
	"lynx": {
		"1": {
			"output": 2,
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "You know who I am?"
					}
				],
				[
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Why are you here, then?"
					}
				]
			],
			"suite": [
				[
					{
						"message": "..."
					},
					{
						"codes": [ [ 5, 1 ] ],
						"message": "You must be Nani."
					},
					{
						"codes": [
							[ 5, 0 ],
							[ 1, 0 ]
						],
						"message": "I knew you'd come traveling down this road eventually, but I wasn't expecting you to arrive here so soon."
					}
				],
				[
					{
						"message": "Of course. You know, I used to be like you, years ago. Full of spirit, and determined to cut down everything in my path."
					},
					{
						"message": "You do remind me of your brother in that way."
					},
					{
						"codes": [
							[ 5, 1 ],
							[ 1, 1 ]
						],
						"message": "No matter. I am not here to redeem you or convince you of anything."
					}
				],
				[
					{
						"codes": [ [ 9, 25702, 1 ] ],
						"message": "To teach you a lesson I learned long ago."
					},
					{
						"codes": [ [ 12, 0 ] ],
						"message": "Enough talking, now. It is time you prove to me why Gus couldn't take care of you himself!"
					}
				]
			]
		},
		"2": {
			"output": 2,
			"responses": [],
			"suite": [
				[
					{
						"codes": [ [ 9, 25703, 1 ] ],
						"message": "Augh..."
					},
					{
						"codes": [
							[ 9, 25701 ],
							[ 9, 25702 ]
						],
						"message": "I have failed..."
					}
				]
			]
		},
		"3": {
			"output": 2,
			"responses": [],
			"suite": [
				[
					{
						"codes": [ [ 5, 2, 1 ] ],
						"message": "HYEAHAH!"
					},
					{
						"message": "It's been a long time since I've had a real challenge like this..."
					},
					{
						"codes": [ [ 5, 3, 1 ] ],
						"message": "Bring it on!"
					}
				]
			]
		},
		"4": {
			"output": 2,
			"responses": [],
			"suite": [
				[
					{
						"codes": [ [ 9, 25702, 1 ] ],
						"messages": [ "Hmph...", "..." ]
					},
					{
						"codes": [ [ 12, 0 ] ],
						"messages": [ "Still determined to defeat me?", "You're not going to win...", "You again?", "Will you ever give up?" ]
					}
				]
			]
		}
	},
	"mildreth": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"messages": [ "My granddaughter doesn't know what she's thinking, marrying a human.", "This town isn't half of what it used to be ever since Skycorps started terrorizing us." ]
					}
				]
			]
		}
	},
	"minigus": {
		"1": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Who are you?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Whatever I need to do."
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Where is my brother?"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [
							[ 9, 11701, 1 ],
							[ 4, 4 ]
						],
						"message": "Well, would you look at that!"
					},
					{
						"message": "The sorry little Kariba has escaped her cell."
					},
					{
						"message": "You know, I'm not exactly surprised. The storms up here are getting worse, and the crew seem more interested in staying alive than retaining prisoners."
					},
					{
						"message": "And yet a prisoner you shall remain, if I have anything to say about it."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Now tell me, girl, what do you plan to do with that pathetic little pistol of yours?"
					}
				],
				[
					{
						"codes": [ [ 4, 3 ] ],
						"message": "I asked you a question."
					},
					{
						"message": "But I'll be kind, considering you haven't much longer to live. My name is Gus, and I lead Lady Nimbus's feared Harpoon Squad."
					},
					{
						"message": "You see, we do whatever cleaning up needs to be done down on the island."
					},
					{
						"codes": [ [ 12, 0 ] ],
						"message": "But anyway, I'm tired of talkin' to you. Get ready to die!"
					}
				],
				[
					{
						"codes": [
							[ 4, 2 ],
							[ 5, 1 ]
						],
						"message": "Hah!"
					},
					{
						"codes": [ [ 5, 0 ] ],
						"message": "Sure is some tough talk for a scrawny girl."
					},
					{
						"codes": [ [ 12, 0 ] ],
						"message": "So, let's see what you've got, then."
					}
				],
				[
					{
						"message": "..."
					},
					{
						"codes": [ [ 4, 1 ] ],
						"message": "Your brother...?"
					},
					{
						"message": "I guess even my trusty little gadget can't completely erase your memories."
					},
					{
						"message": "But either way, you'll get no further information from me on that front."
					},
					{
						"codes": [ [ 12, 0 ] ],
						"message": "Now, I'm tired of talkin' to you. Get ready to die!"
					}
				]
			]
		},
		"2": {
			"responses": [],
			"suite": [
				[
					{
						"codes": [ [ 5, 2 ] ],
						"message": "..."
					},
					{
						"message": "GAH!!!"
					},
					{
						"codes": [ [ 9, 1171 ] ],
						"message": "My mask!! What have you done?!"
					}
				]
			]
		},
		"3": {
			"responses": [],
			"suite": [
				[
					{
						"codes": [
							[ 5, 2 ],
							[ 4, 5 ]
						],
						"message": "This isn't over!"
					}
				]
			]
		},
		"4": {
			"responses": [],
			"suite": [
				[
					{
						"codes": [
							[ 12, 0 ]
						],
						"messages": [ "Back for more?", "Had enough yet?", "You don't know when to quit, do you?" ]
					}
				]
			]
		}
	},
	"mirin": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"codes": [ [ 3, 2, 18 ] ],
						"message": "You must be one of the prisoners we scooped up some months back."
					},
					{
						"codes": [ [ 5, 1 ] ],
						"message": "You know, despite everything that's happened between our tribes, I would never wish any of this upon you."
					},
					{
						"codes": [
							[ 13, 18, 114 ],
							[ 5, 0 ]
						],
						"message": "There's something about being so high up in the sky that tends to bring our people together."
					}
				]
			]
		},
		"2": {
			"responses": [],
			"suite": [
				[
					{
						"message": "I'm not sure what you want me to tell you. I'm not exactly itching to chit-chat at a time like this."
					},
					{
						"message": "..."
					},
					{
						"codes": [
							[ 13, 18, 114 ],
							[ 5, 1 ]
						],
						"message": "Okay, that was a bit rude. Sorry."
					},
					{
						"message": "I've just been trying to come to terms with my impending death. I hope you understand."
					}
				]
			]
		},
		"3": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Who are you?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "How can I get back to the island?"
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Tell me about your tribe."
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"message": "What's up?"
					}
				],
				[
					{
						"codes": [ [ 1, 0 ] ],
						"message": "I'm Mirin. I'm Dr. Go's daughter, and though I have no qualifications to be a nurse, that's what I am."
					}
				],
				[
					{
						"message": "If I knew the answer to that, we wouldn't be having this conversation."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "We're miles in the sky, and the last time I looked outside, I saw nothing but raging clouds."
					}
				],
				[
					{
						"message": "Damn, your captors must have whacked you over the head or something."
					},
					{
						"message": "We're the Ooplo, and we've been at war with your people for the last hundred years."
					},
					{
						"message": "The Kariba come, they kill one of us, they leave, repeat."
					},
					{
						"codes": [ [ 5, 1 ] ],
						"message": "The tables really turned when Skycorps came in and took our side against you. It was our turn to do the needless killing, and we went way overboard."
					},
					{
						"message": "For that, I'm sorry, although neither I nor anyone I know had much of anything to do with the actual fighting."
					},
					{
						"message": "In the end, we Ooplo got what was coming to us when Skycorps basically enslaved us all."
					},
					{
						"codes": [
							[ 1, 0 ],
							[ 5, 2 ]
						],
						"message": "I coun't myself lucky. At least I wasn't turned into one of their mutation experiments."
					}
				]
			]
		}
	},
	"otto": {
		"1": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "What have you got for sale?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Are you from around here?"
					},
					{
						"codes": [ [ 1, 3 ] ],
						"message": "Tell me about Woodshine."
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"messages": [ "How can I help you?", "Welcome to Otto's Emporium!" ]
					}
				],
				[
					{
						"message": "Take a gander!"
					}
				],
				[
					{
						"message": "I was born on Grand Island, but my folks moved here in hopes that the Nightside projects would come to fruition."
					},
					{
						"message": "And, well... You don't need me to tell you how that went down."
					},
					{
						"message": "Anyhow, my parents died a while back and left me this foreign goods shop to trade with the Kariba here. Woodshine's been my home ever since."
					},
					{
						"message": "Say, you've been gone for a while without a word. Does your father know you're back around here again?"
					}
				],
				[
					{
						"message": "Well, it's the last place on the island that any Kariba call home, as far as I know."
					},
					{
						"message": "It's been raided and ransacked and whittled down to what it is now over the last hundred years or so, and lately the residents have been keen to lay low and let the place get overgrown."
					},
					{
						"message": "They prefer to keep quiet after the hell your brother raised against Skycorps. To them, protecting the sacred grounds is more important than raising arms against them."
					},
					{
						"message": "Things have been much calmer ever since he left. You wouldn't happen to know where he went off to, now, would you?"
					}
				]
			]
		}
	},
	"wames": {
		"1": {
			"responses": [],
			"suite": [
				[
					{
						"message": "Your father is right to be worried about you. Yours is too reckless a spirit!"
					}
				]
			]
		}
	},
	"ward": {
		"1": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Why is the trail blocked?"
					}
				],
				[
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Can you let me through?"
					}
				]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Take a rest here, if you'd like. It's a cruel world."
					}
				],
				[
					{
						"message": "It's a means of protecting us and Woodshine. Or, whatever's left of it at least."
					},
					{
						"codes": [ [ 1, 1 ] ],
						"message": "Your father stationed me here a few months ago, and I've been hunkered down since."
					}
				],
				[
					{
						"message": "Afraid not. Chieftain's orders."
					},
					{
						"message": "If you want me to grant you passage, I'll need written permission from him."
					},
					{
						"codes": [ [ 9, 225, 1 ] ],
						"message": "Shouldn't be too hard to get, eh? After all, he is your dad."
					}
				]
			]
		},
		"2": {
			"responses": [
				[
					{
						"codes": [ [ 1, 1 ] ],
						"message": "What lies beyond the barrier?"
					},
					{
						"codes": [ [ 1, 2 ] ],
						"message": "Tell me about the forest."
					}
				],
				[]
			],
			"suite": [
				[
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Hm?"
					}
				],
				[
					{
						"message": "The Pioneer Trail. It's an old trade route the pioneers used to use way back when. It's since been blocked off by the Mother Worm, so it's mostly abandoned."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "Some lone travelers still take that way to Ashtown, though, because even if it's rough going, it's pretty fast. Just pray you don't get trapped inside the Mother or suffocate in the toxic caverns beyond..."
					}
				],
				[
					{
						"message": "These woods are not for the faint of heart, nor outsiders of any ilk."
					},
					{
						"message": "They are shrouded in mystery and home to thousands of spirits and rhenite demons. And despite all that, I still feel quite at peace here."
					},
					{
						"codes": [ [ 1, 0 ] ],
						"message": "I imagine you do, too. You are a young Kariba, and your tenacious spirit emanates from you!"
					}
				]
			]
		}
	}
}
